import { LOCALES } from "../locales";

const a = {
    [LOCALES.RUSSIAN]: {
        'lang': 'ru',
        'menu_link_1': 'Главная',
        'menu_link_2': 'Работники',
        'menu_link_3': 'Избранные',
        'menu_link_4': 'Команда',
        'menu_link_5': 'Детали',
        'menu_link_6': 'Политика конфиденциальности',
        'menu_link_7': 'Условия использования',
        'menu_link_8': 'Контакты',
        'menu_link_9': 'О нас',

        'meta_description': 'Найди свою сезонную работу в Германии. Трудоустройство в сфере сельского хозяйства без посредников',
        'meta_keywords': 'Подработка в Германии, сезонная работа в Германии, кратковременная работа за границей, работа на полях Германии, збор урожая в Германии',

        'main_title_categories': 'Категории',

        'header_title_1': 'Хотите быстро найти рабочего?',
        'header_title_2': 'Хотите быть первыми в отрасли?',
        'header_title_3': 'Хотите быть самостоятельными и гибкими?',
        'header_subtitle_1': 'Мы даем вам такую возможность после регистрации.',
        'header_subtitle_2': 'Мы создали веб-платформу, которая предоставляет конкурентные преимущества в трудоустройстве.',
        'header_subtitle_3': 'Мы лишаем вас необходимости иметь дело с посредниками и бюрократией.',

        'about_title_1': 'НАШ САЙТ',
        'about_title_2': 'КТО МЫ',
        'about_title_3': 'ЧТО МЫ ДЕЛАЕМ',
        'about_description_1': 'Мы создали для вас уникальное цифровое пространство, преодолевающее временные и бюрократические препятствия на пути поиска и найма необходимых Вам рабочих в разрезе основных отраслей хозяйства.',
        'about_description_2': 'Мы надежные, талантливые и опытные специалисты, которые создали свою собственную команду для того, чтобы предоставить вам возможность быстро и без всяких препятствий находить нужных вам людей и объединять их в рабочие команды на определенный вами период времени. Наша команда сформировалась, в первую очередь, вокруг идеи создания такого экономическо-цифрового феномена, который будет способствовать развитию и совершенствованию отношений в сфере трудоустройства, побуждая экономическое и социальное процветание рабочих профессий.',
        'about_description_3': 'Сейчас мы создали уникальную веб-платформу, позволяющую работодателям и соискателям устанавливать прямые рабочие связи без лишних посредников. Мы исключили необходимость агентских услуг, обычно создающих временные, пространственные, финансовые и бюроктатические препятствия между теми, кто находится в поиске работы и теми, кто имеет свободные рабочие места.',

        'footer_subtitle_1': 'Навигация',
        'footer_subtitle_2': 'Полезные сылки',

        'title-reserved': 'Все права защищены',
        'title-contact': 'Есть вопросы? Не стесняйтесь связаться с нами!',
        'title-view-all': 'Смотреть все',
        'title-sort-by': 'Сортировка',

        'contact_name': 'Ваше Имя',
        'contact_email': 'Email адрес',
        'contact_subject': 'Тема',
        'contact_message': 'Сообщение',
        'contact_button': 'Отправить сообщение',
        'contact_alert': 'Спасибо, мы свяжемся с вами как можно скорее!',

        'card_age': 'Возраст',
        'card_gender': 'Пол',
        'card_button_send': 'Добавить в команду',
        'card_button_remove': 'Удалить с команды',
        'card_button_profile': 'Смотреть профиль',
        'card_date': 'Профиль создан',
        'card_available': 'Доступные даты',
        'card_vaccination': 'Вакцинация',
        'card_access': 'Запрет на вьезд в ЕС',
        'card_more': 'Смотреть все',

        'section_description_about': 'Хобби',
        'section_description_skills': 'Навыки',
        'section_description_general': 'Главная информация',
        'section_description_language': 'Языки',
        'section_description_driver': 'Водильское удостоверение',

        'sort_from': 'С',
        'sort_to': 'По',
        'sort_title_categories': 'Категории',
        'sort_title_available': 'Доступные даты',
        'sort_title_age': 'Возраст',
        'sort_title_gender': 'Пол',
        'sort_title_vaccination': 'Вакцинация',
        'sort_title_family': 'Семейное положение',
        'sort_title_driver': 'Водильское удостоверение',
        'sort_title_weight': 'Вес',
        'sort_title_height': 'Рост',
        'sort_title_access': 'Запрет на вьезд в ЕС',

        'sort_label_category': 'Категория',
        'sort_label_available': 'Доступные даты',
        'sort_label_age': 'Возраст (min, max)',
        'sort_label_gender': 'Пол',
        'sort_label_vaccination': 'Вакцинация',
        'sort_label_family': 'Семейное положение',
        'sort_label_driver': 'Водильское удостоверение',
        'sort_alert_wrong_date': 'Неверная дата',

        'alert-empty': 'Пока пусто'
    }
}

export default a
