import { LOCALES } from "../locales";

const a = {
    [LOCALES.UKRAINIAN]: {
        'lang': 'ua',
        'menu_link_1': 'Головна',
        'menu_link_2': 'Працівники',
        'menu_link_3': 'Вибрані',
        'menu_link_4': 'Команда',
        'menu_link_5': 'Деталі',
        'menu_link_6': 'Політика конфіденційності',
        'menu_link_7': 'Умови використання',
        'menu_link_8': 'Контакти',
        'menu_link_9': 'Про нас',
        'menu_link_10': '404 Не знайдено',

        "team_1_text": "Я розробник програмного забезпечення, з освітою в галузі кіберзахисту та криптографії. Захоплююсь спортом, трекінгом та DIY.",
        "team_2_text": "Я HTML-розробник, з радіотехнічною освітою. Люблю шахи, рибалку.",
        "team_3_text": "Я спеціаліст по автоматизації процесів забезпечення якості з солідним досвідом у сфері економіки та фінансів.",
        "team_4_text": "Я кваліфікований інженер зв'язку. Додаткова вища освіта у галузі міжнародної економіки. Захоплююсь сільським господарством та фермерством. Живу та працюю в Німеччині.",

        "team_1_slogan": "Люблю ставити цілі та долати труднощі!",
        "team_2_slogan": "У всьому має бути творчий підхід.",
        "team_3_slogan": "Отримую задоволення від написання дисертації з інвестицій у сільське господарство.",
        "team_4_slogan": "Не чекайте на можливості. Створюйте її.",

        'about_title_1': 'ХТО МИ',
        'about_title_2': 'ІДЕЯ',
        'about_title_3': 'ЩО МИ РОБИМО',
        'about_description_1': 'Ми надійні, талановиті та досвідчені фахівці, які створили свою власну команду задля того, щоби надати Вам можливість швидко та без будь-яких перешкод знаходити потрібних людей та об’єднувати їх у робітничі команди на визначений вами період часу.',
        'about_description_2': 'Наша команда сформувалася, в першу чергу, навколо ідеї створення такого економічно-цифорового феномену, який сприятиме розвитку та вдосконаленню відносин у сфері працевлаштування, спонукаючи економічне та соціальне процвітання робітничих професій.',
        'about_description_3': 'Наразі ми створили унікальну веб-платформу, яка надає можливість роботодавцям та пошукачам встановлювати прямі робочі зв’язки без зайвих посередників. Ми виключили необхідність агентських послуг, які зазвичай створюють часові, просторові, фінансові та бюроктатичні перешкоди між тими, хто знаходиться у пошуках роботи та тими, хто має вільні робочі місця.',

        '404_title': 'Нам шкода, але сторінки, яку Ви шукали, не існує',

        'meta_description': 'Знайди свою сезонну роботу у Німеччині. Працевлаштування у сфері сільського господарства без посередників',
        'meta_keywords': 'Заробіток у Німеччині, сезонна робота в Німеччині, короткочасна робота за кордоном, робота в полях Німеччини, збирання врожаю в Німеччині',

        'main_title_categories': 'Категорії',

        'header_title_1': 'ХОЧЕТЕ ШВИДКО ЗНАЙТИ РОБІТНИКА?',
        'header_title_2': 'ХОЧЕТЕ БУТИ ПЕРШИМИ У ГАЛУЗІ?',
        'header_title_3': 'ХОЧЕТЕ БУТИ САМОСТІЙНИМИ ТА ГНУЧКИМИ?',
        'header_subtitle_1': 'Ми надаємо вам таку можливість після реєстрації.',
        'header_subtitle_2': 'Ми створили веб платформу, яка надає конкурентні переваги у працевлаштуванні.',
        'header_subtitle_3': 'Ми позбавляємо вас необхідності  мати справи з посередниками та бюрократією.',

        'footer_subtitle_1': 'Навігація',
        'footer_subtitle_2': 'Корисні посилання',

        'title-reserved': 'Всі права захищені',
        'title-contact': 'Є питання? Не соромтеся зв\'язатися з нами!',
        'title-view-all': 'Дивитись все',
        'title-sort-by': 'Сортування',

        'contact_name': 'Ваше ім\'я',
        'contact_email': 'Email адреса',
        'contact_subject': 'Тема',
        'contact_message': 'Повідомлення',
        'contact_button': 'Надіслати повідомлення',
        'contact_alert': 'Дякуємо, ми зв\'яжемося з вами якнайшвидше!',

        'card_age': 'Вік',
        'card_gender': 'Стать',
        'card_button_send': 'Додати до команди',
        'card_button_remove': 'Видалити з команди',
        'card_button_profile': 'Дивитися профіль',
        'card_date': 'Профіль створено',
        'card_available': 'Доступні дати',
        'card_vaccination': 'Вакцинація',
        'card_access': 'Заборона в\'їзду в ЄС',
        'card_more': 'Дивитись всi',

        'section_description_about': 'Хоббі',
        'section_description_skills': 'Навички',
        'section_description_general': 'Голавна інформация',
        'section_description_language': 'Мови',
        'section_description_driver': 'Посвідчення водія',

        'sort_from': 'З',
        'sort_to': 'По',
        'sort_title_categories': 'Категорії',
        'sort_title_available': 'Доступні дати',
        'sort_title_age': 'Вік',
        'sort_title_gender': 'Стать',
        'sort_title_vaccination': 'Вакцинація',
        'sort_title_family': 'Сімейний стан',
        'sort_title_driver': 'Посвідчення водія',
        'sort_title_weight': 'Вага',
        'sort_title_height': 'Зріст',
        'sort_title_access': 'Заборона в\'їзду в ЄС',

        'sort_label_category': 'Категорія',
        'sort_label_available': 'Доступні дати',
        'sort_label_age': 'Вік (min, max)',
        'sort_label_gender': 'Стать',
        'sort_label_vaccination': 'Вакцинація',
        'sort_label_family': 'Сімейний стан',
        'sort_label_driver': 'Посвідчення водія',
        'sort_alert_wrong_date': 'Невірна дата',

        'alert-empty': 'Поки що порожньо'
    }
}

export default a
